{
  "backend/main.mo": "Motoko backend actor implementing user profiles, posts, friends, reports, validation, and rate limiting with various data structures and helper functions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose and behavior.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables and themes for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the root React app.",
  "frontend/src/App.tsx": "Root React component controlling authentication, age verification, and main app routing with theming and loading states.",
  "frontend/src/components/feed/PostCard.tsx": "UI component rendering an individual feed post with like, delete, friend request, and report actions.",
  "frontend/src/components/feed/PostComposer.tsx": "Component for creating new posts with length validation, submission handling, and feedback messages.",
  "frontend/src/components/friends/FriendRequestsPanel.tsx": "Renders pending friend requests with profile info and accept/decline actions using mutations and toasts.",
  "frontend/src/components/friends/FriendsList.tsx": "Displays a list of friends with profile details, loading states, and genre badges.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, mobile menu, and page routing via local state.",
  "frontend/src/components/report/ReportDialog.tsx": "Provides a dialog for submitting content reports with reason selection, details, validation, and mutation handling.",
  "frontend/src/components/system/ErrorBoundary.tsx": "React error boundary that displays an error card with details and a reload option when exceptions occur.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, feeds, posts, and mutations interacting with the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes.",
  "frontend/src/lib/genres.ts": "Provides helpers for genre labels and a predefined list of genre options.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into relative or date strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AgeVerificationPage.tsx": "Renders age verification and profile creation form with validation and mutation submission.",
  "frontend/src/pages/FeedPage.tsx": "Displays the community feed with post creation and a list of posts.",
  "frontend/src/pages/FriendsPage.tsx": "Shows friends and friend requests in tabbed sections after loading data.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with login button, hero layout, and feature highlights.",
  "frontend/src/pages/ProfilePage.tsx": "Provides user profile viewing and editing with validation and update mutations.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings UI with sign‑out functionality and detailed information about custom domain rules and examples.",
  "frontend/src/utils/backendErrors.ts": "Converts backend error messages into cleaner, user‑friendly errors with specific handling for validation, authorization, and rate limiting.",
  "frontend/src/utils/buildInfo.ts": "Provides utilities to read build timestamp/version from environment variables and format them for display.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates display names according to length and character rules and provides a short description of those rules.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Stores the project’s current metadata, requirements, architecture notes, issues, and implemented features."
}