{
  "backend/main.mo": "Main backend actor implementing a 21+ social network for metal/rock/punk fans with user profiles, friend requests, feed posts, blocking, reporting, rate limiting, and access control authorization.",
  "feature_evidence.json": "Feature evidence report documenting removal of booking/venue/ticketing references and confirmation that UI clearly communicates MetalHead Underground as a 21+ social networking platform.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, components, hooks, utilities, and styling with details on authentication, age verification, feed, friends, profiles, blocking, reporting, and error handling.",
  "frontend/delete-account/index.html": "HTML entry point for the public delete account page required for Google Play submission, with MetalHead Underground branding and PWA metadata.",
  "frontend/docs/google-play-aab.md": "Documentation guide for building an Android App Bundle (AAB) using Trusted Web Activity (TWA) approach with Bubblewrap for Google Play publishing.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system using red/orange primary palette for rock/metal aesthetic in both light and dark modes.",
  "frontend/index.html": "Main HTML entry point with MetalHead Underground branding, meta description clearly stating it's a 21+ social network for metal fans, and PWA manifest links.",
  "frontend/public/.well-known/assetlinks.json": "Android Digital Asset Links configuration template for TWA app verification with placeholders for package name and certificate fingerprint.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining MetalHead Underground as a 21+ social network for rock/punk/metal fans with standalone display mode and branding colors.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, age verification, delete account page routing, in-app browser detection, and main app shell with integrated cache clearing modal.",
  "frontend/src/components/blocks/BlockedUserRow.tsx": "Component displaying a blocked user with their profile information and an unblock button with toast notifications for success/error feedback.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a single post card with like, delete, friend request, block/unblock, and report functionality. Handles user interactions and shows post metadata including author, timestamp, and like count.",
  "frontend/src/components/feed/PostComposer.tsx": "Provides a textarea form for creating new posts with a 500-character limit and character counter. Validates input and displays success/error toasts on submission.",
  "frontend/src/components/friends/FriendRequestsPanel.tsx": "Displays a list of pending friend requests with accept/decline buttons. Shows user avatars and names, with empty state when no requests exist.",
  "frontend/src/components/friends/FriendsList.tsx": "Renders a grid of friend cards showing avatars, display names, bios, and favorite genres. Includes loading states and empty state messaging.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with responsive navigation for desktop and mobile, including page routing between Feed, Friends, Profile, Blocked, and Settings. Includes network status indicator and logout functionality.",
  "frontend/src/components/profile/ClearFavoriteBandsConfirmDialog.tsx": "Confirmation dialog for removing all favorite bands from a user's profile, displaying the count of bands to be removed with cancel and confirm actions.",
  "frontend/src/components/report/ReportDialog.tsx": "Modal dialog for reporting posts or users with predefined reason selection and optional details field (150 char max). Submits reports and displays success/error feedback.",
  "frontend/src/components/settings/PublishToGooglePlaySection.tsx": "Displays a step-by-step checklist UI for publishing the MetalHead app to Google Play, including creating a developer account, generating an AAB file, uploading to Play Console, and completing required forms. Integrates the StoreAssetsPanel component for store listing assets.",
  "frontend/src/components/settings/StoreAssetsPanel.tsx": "Renders a grid of downloadable store listing assets (app icon, feature graphic, screenshots) with preview images and external links. Includes an alert about PWA icons referenced in the web app manifest.",
  "frontend/src/components/system/CacheClearingModal.tsx": "Modal that appears after 3 consecutive gateway connection failures, providing device-specific cache clearing instructions and alternative solutions like switching networks or trying a different gateway URL.",
  "frontend/src/components/system/ErrorBoundary.tsx": "React error boundary component that catches unhandled errors and displays a user-friendly error card with the error message and a reload button.",
  "frontend/src/components/system/InAppBrowserNotice.tsx": "Full-screen overlay warning users about login compatibility issues in in-app browsers, providing instructions to open the app in a regular browser with quick action buttons to copy the URL or open externally.",
  "frontend/src/components/system/NetworkStatusIndicator.tsx": "Displays a status icon in the UI showing gateway connection state (failed, fallback, or normal), with a tooltip providing details and a retry button when connection has failed.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGatewayStatus.ts": "Zustand store for tracking gateway connection state (normal/fallback/failed), consecutive failures, and retry counts. Includes a manual retry hook that reloads the page.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profiles, posts, friend requests, and reports. Integrates gateway status tracking for error handling and retries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and component styling tokens.",
  "frontend/src/lib/genres.ts": "Utility functions and constants for music genre handling, including label formatting and predefined genre options (Rock, Punk, Metal, etc.).",
  "frontend/src/lib/time.ts": "Utility function to format timestamps as relative time strings (e.g., '5m ago', '2h ago', '3d ago').",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AgeVerificationPage.tsx": "Age verification and initial profile creation page requiring users to confirm they are 21+ and provide a display name with validation.",
  "frontend/src/pages/BlockedUsersPage.tsx": "Page displaying a list of blocked users with BlockedUserRow components, showing loading and empty states.",
  "frontend/src/pages/DeleteAccountPage.tsx": "Account deletion page with authentication check, confirmation dialog, and warnings about permanent data removal including profile, posts, and connections.",
  "frontend/src/pages/FeedPage.tsx": "Displays the main feed page with a post composer and a list of posts fetched via useGetFeed hook, showing loading and empty states.",
  "frontend/src/pages/FriendsPage.tsx": "Renders a tabbed interface for viewing friends list and pending friend requests, with loading states for each tab.",
  "frontend/src/pages/LandingPage.tsx": "Landing page for unauthenticated users featuring hero imagery, branding for a metal/rock social network, and Internet Identity login button with age verification notice.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page allowing users to update display name, bio, location, favorite genres, and favorite bands with validation and a confirmation dialog for clearing bands.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with sign-out functionality, account deletion navigation, app link sharing, build info display, and Google Play publishing section.",
  "frontend/src/utils/backendErrors.ts": "Normalizes backend error messages into user-friendly strings, handling rate limiting, blocking, and various validation errors for display names, bios, posts, genres, and bands.",
  "frontend/src/utils/buildInfo.ts": "Provides build information utilities to retrieve and format build timestamp and version from environment variables or defaults.",
  "frontend/src/utils/deviceDetection.ts": "Detects device type (Android/iOS/desktop) and browser type, providing platform-specific cache clearing instructions for troubleshooting.",
  "frontend/src/utils/externalBrowserActions.ts": "Provides functions to copy the current app URL to clipboard and attempt to open it in an external browser, with toast notifications for user feedback.",
  "frontend/src/utils/gatewayFallback.ts": "Implements ICP gateway error detection and retry logic with exponential backoff, including fallback to alternative gateway URLs (raw.icp0.io) when resolution fails.",
  "frontend/src/utils/iiReturnFlow.ts": "Detects if the current URL is an Internet Identity callback/return URL by checking for common II authentication patterns in the URL and hash.",
  "frontend/src/utils/inAppBrowser.ts": "Detects Facebook/Messenger/Instagram in-app browsers via user agent strings and provides platform-specific instructions for opening links in external browsers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/src/utils/validation.ts": "Validates display names (5-50 characters, alphanumeric and hyphens only) and provides user-friendly error messages and rule descriptions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, container queries, typography plugin, and custom animations.",
  "frontend/vite.config.ts": "Vite configuration for React app with path aliases, environment variable injection for canisters, multi-page build setup (main and delete-account), and local API proxy.",
  "project_state.json": "Project state tracking removal of band/venue/booking UI elements and ensuring social networking features for 21+ metal/rock/punk fans are correctly displayed."
}