{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend Gateway Fallback & Network Resilience",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement automatic gateway fallback mechanism for failed canister requests",
      "acceptanceCriteria": [
        "When a canister request fails with gateway resolution errors, the system automatically retries using the raw.icp0.io gateway",
        "Users see a loading state during retry attempts",
        "Failed requests are logged for debugging",
        "Successful retry displays content without requiring manual URL changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Add gateway fallback logic to the actor creation flow. When the primary gateway fails with 'Canister ID not resolved' or similar errors, automatically retry the request using raw.icp0.io as an alternative gateway URL. Include error detection logic, retry state management, and logging for debugging. Ensure the fallback mechanism integrates with the existing Internet Identity flow without breaking authentication."
        },
        {
          "path": "frontend/src/utils/gatewayFallback.ts",
          "operation": "create",
          "description": "Create utility functions for gateway fallback handling including: detecting gateway resolution errors from error messages, building alternative gateway URLs (raw.icp0.io), managing retry attempts with exponential backoff, and logging failed requests for debugging. Export a reusable retry wrapper that can be used by the actor hook."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Integrate gateway fallback retry logic into query error handling. When queries fail due to gateway issues, trigger the fallback mechanism before marking the query as failed. Ensure loading states are preserved during retry attempts and that successful retries update the query cache correctly."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add network status indicator with gateway connectivity monitoring and manual retry",
      "acceptanceCriteria": [
        "Status indicator shows green when gateway is responding normally",
        "Status indicator shows yellow/warning when using fallback gateway",
        "Status indicator shows red when gateway requests are failing",
        "Manual retry button allows users to force a connection attempt",
        "Indicator is visible but unobtrusive in the app layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/system/NetworkStatusIndicator.tsx",
          "operation": "create",
          "description": "Create a network status indicator component that displays gateway connectivity state using color-coded visual feedback (green for normal, yellow for fallback, red for failures). Include a manual retry button that forces a connection attempt. Use React Query's network status and custom gateway state to determine the indicator color. Position the indicator in a visible but unobtrusive location (e.g., top-right corner with a small badge/icon)."
        },
        {
          "path": "frontend/src/hooks/useGatewayStatus.ts",
          "operation": "create",
          "description": "Create a custom hook that tracks gateway connectivity status by monitoring actor creation attempts, query failures, and fallback usage. Export gateway state (normal, fallback, failed), retry count, last error timestamp, and a manual retry function. Use React context or a simple state manager to share status across the app."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the NetworkStatusIndicator component into the app header/shell layout. Position it in the top navigation area where it's visible but doesn't interfere with existing navigation elements. Ensure it appears on all authenticated pages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add gateway status context provider to wrap the app, making the status hook available throughout the component tree. Integrate with existing Internet Identity and React Query providers."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement cache clearing suggestion modal for persistent gateway errors",
      "acceptanceCriteria": [
        "After 3 consecutive gateway failures, show a helpful modal with cache clearing instructions",
        "Instructions are device-specific (Android tablet, phone, desktop)",
        "Modal includes options to try alternative gateway or switch networks",
        "Users can dismiss the modal and continue attempting",
        "Modal does not appear more than once per session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/system/CacheClearingModal.tsx",
          "operation": "create",
          "description": "Create a modal component that displays device-specific cache clearing instructions when persistent gateway errors are detected. Include step-by-step instructions for Android tablets, phones, and desktop browsers. Add action buttons for trying the alternative gateway and dismissing the modal. Track modal display in sessionStorage to prevent showing more than once per session."
        },
        {
          "path": "frontend/src/utils/deviceDetection.ts",
          "operation": "create",
          "description": "Create utility functions to detect the user's device type (Android tablet, Android phone, iOS, desktop) and browser. Export a function that returns device-specific cache clearing instructions with clear steps for each platform. Include detection for common browsers (Chrome, Firefox, Safari, Edge)."
        },
        {
          "path": "frontend/src/hooks/useGatewayStatus.ts",
          "operation": "modify",
          "description": "Add consecutive failure tracking to the gateway status hook. When failures reach the threshold (3 consecutive failures), trigger the cache clearing modal. Track modal display state in sessionStorage to prevent repeated displays. Reset failure count on successful requests."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the CacheClearingModal component into the root app component, controlled by the gateway status hook. Ensure the modal appears above other UI elements when triggered and doesn't block critical functionality."
        }
      ]
    }
  ]
}