{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix UI displaying incorrect bands/shows/venues content",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all UI elements, text, and references related to booking bands, shows, venues, concerts, tour dates, event listings, or ticketing from the frontend application",
      "acceptanceCriteria": [
        "No text or UI elements mention bands booking shows or venues",
        "No references to concerts, tour dates, or event management",
        "No ticketing or venue-related features are visible",
        "All pages display only social networking features (profiles, friends, posts, feed)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Review and remove any text or UI elements that incorrectly suggest band booking, venue management, concert listings, tour dates, or ticketing functionality. Ensure the page clearly presents MetalHead Underground as a social networking platform for connecting metalheads, not a booking service."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review all text, comments, and UI flow for references to booking, venues, concerts, or events. Remove any incorrect messaging that doesn't align with the social networking purpose."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Remove any navigation items, menu text, or UI elements related to band booking, venue management, concert scheduling, or ticketing. Ensure navigation only includes social features: Feed, Friends, Profile, Blocked, Settings."
        },
        {
          "path": "frontend/src/pages/AgeVerificationPage.tsx",
          "operation": "modify",
          "description": "Remove any references to booking bands, venues, or events. Ensure messaging focuses on age verification for joining a 21+ metal/rock social community."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Remove any settings, options, or text related to band booking, venue management, or event features. Keep only social networking settings."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure all user-facing text and UI elements clearly communicate that MetalHead Underground is a social networking platform for 21+ metal/rock/punk fans to connect, share posts, and make friends",
      "acceptanceCriteria": [
        "Landing page clearly describes the app as a social network for metalheads",
        "All feature descriptions emphasize user profiles, friend connections, and social feed",
        "No confusion about the app's core purpose as a community platform",
        "Marketing copy focuses on connecting people, not booking services"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update hero section, feature descriptions, and all marketing copy to clearly communicate that MetalHead Underground is a social networking platform where 21+ metal/rock/punk fans connect, share posts, make friends, and build a community. Emphasize social features: user profiles with favorite bands/genres, friend connections, post feed with likes/comments, and community building. Remove any ambiguous language that could be misinterpreted as booking or event services."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update page title and meta description to clearly state that MetalHead Underground is a social network for 21+ metal/rock/punk fans to connect and share, not a booking platform. Ensure meta tags accurately describe the app's social networking purpose."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Update app name, short_name, and description in the PWA manifest to clearly communicate that MetalHead Underground is a social networking platform for connecting metalheads, emphasizing community and friendship over any booking services."
        },
        {
          "path": "frontend/src/pages/AgeVerificationPage.tsx",
          "operation": "modify",
          "description": "Update age verification messaging to clearly state users are joining a 21+ social network for metal/rock/punk fans to connect, share posts, and make friends. Avoid any language suggesting booking or event services."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify that all existing social networking features (user profiles with favorite bands/genres, friend requests, social feed with posts/likes/comments, blocking, reporting) are correctly displayed and functional in the UI",
      "acceptanceCriteria": [
        "Feed page shows post composer and user posts",
        "Friends page displays friends list and pending requests",
        "Profile page allows editing display name, bio, location, favorite genres, and bands",
        "Blocking and reporting features are accessible",
        "All social networking features work as intended"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FeedPage.tsx",
          "operation": "modify",
          "description": "Verify the feed page correctly renders the PostComposer component and displays user posts fetched from useGetFeed hook. Ensure all social features (liking, commenting if applicable, reporting) are properly wired and functional. Confirm loading and empty states display correctly."
        },
        {
          "path": "frontend/src/pages/FriendsPage.tsx",
          "operation": "modify",
          "description": "Verify the friends page correctly displays the friends list via FriendsList component and pending friend requests via FriendRequestsPanel component. Ensure tab navigation works, hooks (useGetFriends, useGetPendingRequests) are properly connected, and loading states display correctly."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Verify the profile editing page correctly displays and allows editing of display name, bio, location, favorite genres, and favorite bands. Ensure validation works, the ClearFavoriteBandsConfirmDialog functions properly, and profile updates save successfully via backend calls."
        },
        {
          "path": "frontend/src/pages/BlockedUsersPage.tsx",
          "operation": "modify",
          "description": "Verify the blocked users page correctly displays the list of blocked users using BlockedUserRow components. Ensure unblock functionality works, loading states display correctly, and empty state shows when no users are blocked."
        },
        {
          "path": "frontend/src/components/feed/PostCard.tsx",
          "operation": "modify",
          "description": "Verify PostCard displays post content, author information, timestamp, and like count correctly. Ensure like, delete, friend request, block/unblock, and report functionality all work as intended and are properly wired to backend calls."
        },
        {
          "path": "frontend/src/components/report/ReportDialog.tsx",
          "operation": "modify",
          "description": "Verify the ReportDialog component correctly displays report reasons, captures user input, and submits reports for both posts and users. Ensure character limits are enforced and toast confirmations appear after successful submission."
        }
      ]
    }
  ]
}